
questions = [
    ("Age", "📅 Укажи свой возраст (в годах):", "input"),
    ("Gender", "🚻 Укажи свой пол:", "choice"),
    ("Sleep_duration", "😴 Сколько часов ты обычно спишь за ночь?", "input"),
    ("Awakenings", "🌙 Сколько раз ты обычно просыпаешься за ночь?", "input"),
    ("Caffeine_consumption", "☕ Сколько кофе ты употребляешь в день (в чашках перед сном)?", "input"),
    ("Alcohol_consumption", "🍷 Сколько алкоголя ты употребляешь в неделю (в порциях перед сном)?", "input"),
    ("Smoking_status", "🚬 Куришь ли ты?", "choice"),
    ("Exercise_frequency", "🏋️‍♂️ Сколько раз в неделю занимаешься спортом?", "input"),
    ("bed_hour", "🕙 Во сколько обычно ложишься спать? (например, 22)", "input"),
    ("wake_hour", "⏰ Во сколько обычно просыпаешься? (например, 7)", "input"),
]
